LoadTesting/scripts/getAnnotationsForUser_All_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 5100.075ms, rate sampling interval: 17416ms
  Thread calibration: mean lat.: 4994.613ms, rate sampling interval: 17285ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.07m     1.32m    4.58m    59.91%
    Req/Sec    20.41      8.40    46.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.69m 
 75.000%    3.25m 
 90.000%    4.07m 
 99.000%    4.53m 
 99.900%    4.58m 
 99.990%    4.59m 
 99.999%    4.59m 
100.000%    4.59m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9117.695     0.000000            1         1.00
   31490.047     0.100000         1204         1.11
   48529.407     0.200000         2409         1.25
   66781.183     0.300000         3610         1.43
   76021.759     0.400000         4822         1.67
  101253.119     0.500000         6017         2.00
  122159.103     0.550000         6619         2.22
  142868.479     0.600000         7227         2.50
  160169.983     0.650000         7822         2.86
  176685.055     0.700000         8425         3.33
  194772.991     0.750000         9025         4.00
  202375.167     0.775000         9330         4.44
  211419.135     0.800000         9629         5.00
  219152.383     0.825000         9928         5.71
  227803.135     0.850000        10233         6.67
  235667.455     0.875000        10531         8.00
  239992.831     0.887500        10683         8.89
  244449.279     0.900000        10831        10.00
  248774.655     0.912500        10985        11.43
  252313.599     0.925000        11134        13.33
  256114.687     0.937500        11281        16.00
  257949.695     0.943750        11357        17.78
  259653.631     0.950000        11432        20.00
  261619.711     0.956250        11507        22.86
  263323.647     0.962500        11584        26.67
  265158.655     0.968750        11662        32.00
  266338.303     0.971875        11697        35.56
  267386.879     0.975000        11735        40.00
  268304.383     0.978125        11772        45.71
  269221.887     0.981250        11809        53.33
  270270.463     0.984375        11851        64.00
  270532.607     0.985938        11867        71.11
  271056.895     0.987500        11883        80.00
  271581.183     0.989062        11906        91.43
  272105.471     0.990625        11924       106.67
  272629.759     0.992188        11944       128.00
  272891.903     0.992969        11952       142.22
  273154.047     0.993750        11959       160.00
  273416.191     0.994531        11970       182.86
  273678.335     0.995313        11980       213.33
  273940.479     0.996094        11990       256.00
  274202.623     0.996484        12001       284.44
  274202.623     0.996875        12001       320.00
  274202.623     0.997266        12001       365.71
  274464.767     0.997656        12013       426.67
  274464.767     0.998047        12013       512.00
  274464.767     0.998242        12013       568.89
  274726.911     0.998437        12025       640.00
  274726.911     0.998633        12025       731.43
  274726.911     0.998828        12025       853.33
  274726.911     0.999023        12025      1024.00
  274726.911     0.999121        12025      1137.78
  274726.911     0.999219        12025      1280.00
  274726.911     0.999316        12025      1462.86
  274989.055     0.999414        12029      1706.67
  274989.055     0.999512        12029      2048.00
  274989.055     0.999561        12029      2275.56
  274989.055     0.999609        12029      2560.00
  274989.055     0.999658        12029      2925.71
  275251.199     0.999707        12033      3413.33
  275251.199     1.000000        12033          inf
#[Mean    =   123910.713, StdDeviation   =    79076.945]
#[Max     =   274989.056, Total count    =        12033]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  12438 requests in 5.00m, 732.65MB read
Requests/sec:     41.48
Transfer/sec:      2.44MB