LoadTesting/scripts/getAnnotationsForUser_All_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 4913.255ms, rate sampling interval: 17104ms
  Thread calibration: mean lat.: 4767.165ms, rate sampling interval: 16957ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.19m     1.22m    4.62m    60.40%
    Req/Sec    28.91      5.77    36.00     57.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.10m 
 75.000%    3.12m 
 90.000%    4.02m 
 99.000%    4.53m 
 99.900%    4.60m 
 99.990%    4.62m 
 99.999%    4.62m 
100.000%    4.62m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9142.271     0.000000            1         1.00
   34930.687     0.100000         1689         1.11
   59572.223     0.200000         3380         1.25
   82706.431     0.300000         5065         1.43
  105381.887     0.400000         6754         1.67
  126222.335     0.500000         8444         2.00
  136445.951     0.550000         9286         2.22
  147193.855     0.600000        10131         2.50
  158859.263     0.650000        10982         2.86
  168689.663     0.700000        11818         3.33
  187432.959     0.750000        12661         4.00
  196214.783     0.775000        13090         4.44
  204734.463     0.800000        13505         5.00
  213778.431     0.825000        13929         5.71
  224002.047     0.850000        14356         6.67
  232914.943     0.875000        14771         8.00
  237109.247     0.887500        14984         8.89
  241041.407     0.900000        15198        10.00
  245497.855     0.912500        15407        11.43
  250216.447     0.925000        15622        13.33
  254541.823     0.937500        15831        16.00
  256376.831     0.943750        15934        17.78
  258736.127     0.950000        16040        20.00
  260964.351     0.956250        16149        22.86
  263323.647     0.962500        16252        26.67
  265682.943     0.968750        16356        32.00
  266862.591     0.971875        16417        35.56
  267649.023     0.975000        16463        40.00
  268304.383     0.978125        16516        45.71
  269221.887     0.981250        16571        53.33
  270270.463     0.984375        16630        64.00
  270794.751     0.985938        16658        71.11
  271056.895     0.987500        16672        80.00
  271581.183     0.989062        16701        91.43
  272367.615     0.990625        16732       106.67
  272891.903     0.992188        16751       128.00
  273416.191     0.992969        16770       142.22
  273678.335     0.993750        16785       160.00
  273940.479     0.994531        16792       182.86
  274464.767     0.995313        16808       213.33
  274726.911     0.996094        16821       256.00
  274989.055     0.996484        16832       284.44
  274989.055     0.996875        16832       320.00
  275251.199     0.997266        16840       365.71
  275513.343     0.997656        16851       426.67
  275513.343     0.998047        16851       512.00
  275775.487     0.998242        16860       568.89
  275775.487     0.998437        16860       640.00
  275775.487     0.998633        16860       731.43
  276037.631     0.998828        16867       853.33
  276037.631     0.999023        16867      1024.00
  276037.631     0.999121        16867      1137.78
  276299.775     0.999219        16872      1280.00
  276299.775     0.999316        16872      1462.86
  276299.775     0.999414        16872      1706.67
  276561.919     0.999512        16873      2048.00
  276824.063     0.999561        16878      2275.56
  276824.063     0.999609        16878      2560.00
  276824.063     0.999658        16878      2925.71
  276824.063     0.999707        16878      3413.33
  276824.063     0.999756        16878      4096.00
  276824.063     0.999780        16878      4551.11
  276824.063     0.999805        16878      5120.00
  277086.207     0.999829        16880      5851.43
  277086.207     0.999854        16880      6826.67
  277086.207     0.999878        16880      8192.00
  277086.207     0.999890        16880      9102.22
  277086.207     0.999902        16880     10240.00
  277086.207     0.999915        16880     11702.86
  277086.207     0.999927        16880     13653.33
  277086.207     0.999939        16880     16384.00
  277348.351     0.999945        16881     18204.44
  277348.351     1.000000        16881          inf
#[Mean    =   131426.305, StdDeviation   =    73063.251]
#[Max     =   277086.208, Total count    =        16881]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  17508 requests in 4.99m, 0.96GB read
  Socket errors: connect 0, read 0, write 0, timeout 1
Requests/sec:     58.45
Transfer/sec:      3.29MB