LoadTesting/scripts/getAnnotationsForUser_Paged_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 3691.638ms, rate sampling interval: 9412ms
  Thread calibration: mean lat.: 3235.577ms, rate sampling interval: 9273ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.71s     3.24s   19.79s    67.98%
    Req/Sec    38.82     54.33   136.00     73.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.39s 
 75.000%   13.08s 
 90.000%   14.57s 
 99.000%   18.94s 
 99.900%   19.76s 
 99.990%   19.79s 
 99.999%   19.81s 
100.000%   19.81s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2605.055     0.000000            1         1.00
    6639.615     0.100000         2233         1.11
    7798.783     0.200000         4452         1.25
    8814.591     0.300000         6686         1.43
    9609.215     0.400000         8895         1.67
   10387.455     0.500000        11138         2.00
   10813.439     0.550000        12235         2.22
   11362.303     0.600000        13347         2.50
   12058.623     0.650000        14453         2.86
   12525.567     0.700000        15566         3.33
   13082.623     0.750000        16678         4.00
   13303.807     0.775000        17234         4.44
   13615.103     0.800000        17799         5.00
   13795.327     0.825000        18348         5.71
   13975.551     0.850000        18923         6.67
   14229.503     0.875000        19475         8.00
   14417.919     0.887500        19747         8.89
   14573.567     0.900000        20010        10.00
   14876.671     0.912500        20284        11.43
   15425.535     0.925000        20568        13.33
   16146.431     0.937500        20842        16.00
   16375.807     0.943750        20981        17.78
   16769.023     0.950000        21123        20.00
   17006.591     0.956250        21258        22.86
   17268.735     0.962500        21400        26.67
   17580.031     0.968750        21550        32.00
   17678.335     0.971875        21610        35.56
   17989.631     0.975000        21691        40.00
   18104.319     0.978125        21746        45.71
   18300.927     0.981250        21815        53.33
   18546.687     0.984375        21886        64.00
   18743.295     0.985938        21922        71.11
   18792.447     0.987500        21956        80.00
   18890.751     0.989062        21996        91.43
   18956.287     0.990625        22031       106.67
   19218.431     0.992188        22063       128.00
   19267.583     0.992969        22073       142.22
   19283.967     0.993750        22091       160.00
   19415.039     0.994531        22118       182.86
   19447.807     0.995313        22125       213.33
   19513.343     0.996094        22150       256.00
   19529.727     0.996484        22159       284.44
   19546.111     0.996875        22165       320.00
   19644.415     0.997266        22169       365.71
   19660.799     0.997656        22179       426.67
   19677.183     0.998047        22187       512.00
   19726.335     0.998242        22191       568.89
   19742.719     0.998437        22200       640.00
   19742.719     0.998633        22200       731.43
   19759.103     0.998828        22212       853.33
   19759.103     0.999023        22212      1024.00
   19759.103     0.999121        22212      1137.78
   19759.103     0.999219        22212      1280.00
   19775.487     0.999316        22220      1462.86
   19775.487     0.999414        22220      1706.67
   19775.487     0.999512        22220      2048.00
   19775.487     0.999561        22220      2275.56
   19791.871     0.999609        22228      2560.00
   19791.871     0.999658        22228      2925.71
   19791.871     0.999707        22228      3413.33
   19791.871     0.999756        22228      4096.00
   19791.871     0.999780        22228      4551.11
   19791.871     0.999805        22228      5120.00
   19791.871     0.999829        22228      5851.43
   19791.871     0.999854        22228      6826.67
   19791.871     0.999878        22228      8192.00
   19791.871     0.999890        22228      9102.22
   19791.871     0.999902        22228     10240.00
   19791.871     0.999915        22228     11702.86
   19791.871     0.999927        22228     13653.33
   19791.871     0.999939        22228     16384.00
   19791.871     0.999945        22228     18204.44
   19791.871     0.999951        22228     20480.00
   19808.255     0.999957        22229     23405.71
   19808.255     1.000000        22229          inf
#[Mean    =    10711.654, StdDeviation   =     3238.184]
#[Max     =    19791.872, Total count    =        22229]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23657 requests in 5.00m, 11.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 984
Requests/sec:     78.82
Transfer/sec:     39.80KB